{
	"@metadata": {
		"authors": [
			"Marijn van Wezel"
		]
	},
	"script-broken-pipe": "{{technical}}\nMessage displayed whenever a broken pipe occurs.",
	"script-broken-pipe-detailed": "{{technical}}\nMessage displayed whenever a broken pipe occurs. Parameters:\n* $1 - message detailing the cause of the broken pipe",
	"script-could-not-validate": "Message displayed whenever the source code could not be validate due to errors.",
	"script-desc": "{{desc|name=Script|url=https://www.mediawiki.org/wiki/Extension:Script}}",
	"script-doc-page-header": "Message displayed at the top of the documentation page. Parameters:\n* $1 - the name of the programming language in which the corresponding script is written\n$2 - the prefixed title of the script",
	"script-doc-page-does-not-exist": "Message displayed if the documentation page does not exist. Parameters:\n* $1 - the name of the programming language in which the script is written\n$2 - the prefixed title of the doc page",
	"script-doc-page-suffix": "The page suffix (subpage) for script documentation pages.",
	"script-doc-page-transclusion": "{{notranslate}}\nMessage displayed if the documentation page does exist. Parameters:\n* $1 - the prefixed title of the doc page",
	"script-engine-logo-indicator-alt-text": "Alt-text of the logo indicator shown on pages in the Script namespace.",
	"script-error-category": "{{tracking category name}}\nTracking category for pages with errors from #script.",
	"script-error-category-desc": "Description on [[Special:TrackingCategories]] for the {{msg-mw|script-error-category}} tracking category.",
	"script-invalid-engine-specification-error": "Error message displayed when trying to construct an engine from an invalid engine specification. Parameters:\n* $1 - the name of the engine that the application tried to construct\n* $2 - the reason for why the specification is invalid",
	"script-invalid-engine-specification-reason-missing-attribute": "Reason displayed when an engine specification is invalid because of a missing attribute. Used as <code>$2</code> in {{msg-mw|script-invalid-engine-specification-exception}}. Parameters:\n* $1 - the name of the attribute that is missing",
	"script-invalid-engine-specification-reason-nonexistent-class": "Reason displayed when an engine specification is invalid because of the specified class does not exist. Used as <code>$2</code> in {{msg-mw|script-invalid-engine-specification-exception}}. Parameters:\n* $1 - the name of the class that does not exist",
	"script-missing-engine-error": "Error message displayed when the user tries to invoke a script for which no engine has been configured. Parameters:\n* $1 - the name of the script the user tried to invoke",
	"script-missing-engine-header": "Message displayed if the engine needed to execute a script is missing.",
	"script-missing-engine-indicator": "Indicator shown when no engine is available for the script.",
	"script-missing-function-name-error": "Error message displayed when the user tries to invoke a script without specifying which function to invoke.",
	"script-no-engine-error": "Error message displayed at the top of the edit form when the user tries to save a script without a valid engine configured for the script's file extension.",
	"script-no-such-engine-error": "Error message displayed when trying to construct an engine that does not exist. Parameters:\n* $1 - the name of the engine that the application tried to construct",
	"script-no-such-script-error": "Error message displayed when the user tries to invoke a script that does not exist. Parameters:\n* $1 - the name of the script the user tried to invoke",
	"script-python-runtime-error": "{{technical}} Error message displayed when a runtime error occurred while running a Python script. Parameters:\n* $1 - the exception message given by Python",
	"script-python-syntax-error": "{{technical}} Error message displayed when a syntax error occurred while compiling a Python script. Parameters:\n* $1 - the syntax error given by Python",
	"script-python-human-name": "{{notranslate}} The human readable name of the Python programming language.",
	"script-python-open-process-error": "Error message displayed when the Python engine process could not be opened. Parameters:\n* $1 - the path to the engine file\n* $2 - the Python executable that was used\n* $3 - the error that was emitted by PHP",
	"script-python-missing-proc-open-error": "Error message displayed when the PHP function <tt>proc_open</tt> is not available. <tt>proc_open</tt> is a PHP function name and <tt>disable_functions</tt> is the name of a PHP configuration. Both these names aren't localized and should not be translated.\n\nSee also:\n* proc_open: https://www.php.net/manual/en/function.proc-open.php\n* disable_functions: https://www.php.net/manual/en/ini.core.php",
	"script-error-prefix": "Prefix appended to error messages shown when the invocation of a script (through the #script parser function) failed.",
	"content-model-script": "Name for the script content model, used when describing what type of content a page contains.",
	"nstab-script": "The name for the tab of the Script namespace.\n\nSee also:\n* {{msg-mw|Nstab-script}}\n* {{msg-mw|Tooltip-ca-nstab-script}}",
	"tooltip-ca-nstab-script": "Tooltip shown when hovering over the {{msg-mw|Nstab-script}} tab.\n\nSee also:\n* {{msg-mw|Nstab-script}}\n* {{msg-mw|Tooltip-ca-nstab-script}}"
}
