{
	"@metadata": {
		"authors": [
			"Marijn van Wezel"
		]
	},
	"ffi-desc": "{{desc|name=FFI|url=https://www.mediawiki.org/wiki/Extension:FFI}}",
	"ffi-engine-logo-indicator-alt-text": "Alt-text of the logo indicator shown on pages in the Script namespace.",
	"ffi-error-category": "{{tracking category name}}\nTracking category for pages with errors from #script.",
	"ffi-error-category-desc": "Description on [[Special:TrackingCategories]] for the {{msg-mw|ffi-error-category}} tracking category.",
	"ffi-invalid-engine-specification-error": "Error message displayed when trying to construct an engine from an invalid engine specification. Parameters:\n* $1 - the name of the engine that the application tried to construct\n* $2 - the reason for why the specification is invalid",
	"ffi-invalid-engine-specification-reason-missing-attribute": "Reason displayed when an engine specification is invalid because of a missing attribute. Used as <code>$2</code> in {{msg-mw|ffi-invalid-engine-specification-exception}}. Parameters:\n* $1 - the name of the attribute that is missing",
	"ffi-invalid-engine-specification-reason-nonexistent-class": "Reason displayed when an engine specification is invalid because of the specified class does not exist. Used as <code>$2</code> in {{msg-mw|ffi-invalid-engine-specification-exception}}. Parameters:\n* $1 - the name of the class that does not exist",
	"ffi-missing-engine-error": "Error message displayed when the user tries to invoke a script for which no engine has been configured. Parameters:\n* $1 - the name of the script the user tried to invoke",
	"ffi-missing-engine-indicator": "Indicator shown when no engine is available for the script.",
	"ffi-missing-function-name-error": "Error message displayed when the user tries to invoke a script without specifying which function to invoke.",
	"ffi-no-engine-error": "Error message displayed at the top of the edit form when the user tries to save a script without a valid engine configured for the script's file extension.",
	"ffi-no-such-engine-error": "Error message displayed when trying to construct an engine that does not exist. Parameters:\n* $1 - the name of the engine that the application tried to construct",
	"ffi-no-such-script-error": "Error message displayed when the user tries to invoke a script that does not exist. Parameters:\n* $1 - the name of the script the user tried to invoke",
	"ffi-script-error-prefix": "Prefix appended to error messages displayed when the invocation of a script using the '#script' parser function fails."
}
